import logging as log
from datetime import datetime
from time import perf_counter
from common import *

log.basicConfig(level=log.DEBUG, format='%(asctime)s - %(levelname)s : %(message)s')

def dc_settings(dcname: str, rawfile_path: str, stdfile_path: str) -> dict:

    dc_setting = {
    'md_test' : {'dcname' : 'md_test',
                'url' : '',
                'get_param' : {},
                'flag_sourcetype':1,#來源資料類型1:csv,2:web crawl                            
                'flag_fieldmapping':2, #欄位對應1:第一欄新增資料日期，2:完全對應，3:自訂對應(在DataImport.py中GetFieldMappingArray新增)
                'first_row_header':2,#'日期'
                'path_rawcsv':rawfile_path,
                'path_stdcsv':stdfile_path,
                'Array_TargetFieldDataType': ("D", "N", "N", "N", "N"),
                'Array_SourceFieldDataType': ("D", "N", "N", "N", "N"),
                'Array_TargetFieldDataName': ("日期", "開盤指數", "最高指數", "最低指數", "收盤指數"),
                'sp_name':'usp_md_test_Add'} ,    
    'md_cm_ta_dailyquotes' : {'dcname' : 'md_cm_ta_dailyquotes',
                'url' : '',
                'get_param' : {},
                'flag_sourcetype':1,#來源資料類型1:csv,2:web crawl                            
                'flag_fieldmapping':2, #欄位對應1:第一欄新增資料日期，2:完全對應，3:自訂對應(在DataImport.py中GetFieldMappingArray新增)
                'first_row_header':2,#'日期'
                'path_rawcsv':rawfile_path,
                'path_stdcsv':stdfile_path,
                'Array_TargetFieldDataType': ("D", "S", "S", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N"),
                'Array_SourceFieldDataType': ("D", "S", "S", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N"),
                'Array_TargetFieldDataName': ("日期","股票代號","股票名稱","開盤價","最高價","最低價","收盤價","漲跌","漲幅","振幅","成交量","成交筆數","成交金額","均張","成交量變動","均張變動","股本","總市值","市值比重","本益比","股價淨值比","本益比4","週轉率","成交值比重","漲跌停","均價","成交量_股"),
                'sp_name':'usp_md_cm_ta_dailyquotes_Add'},    
    'md_cm_ta_dailyquotes_adj' : {'dcname' : 'md_cm_ta_dailyquotes_adj',
                'url' : '',
                'get_param' : {},
                'flag_sourcetype':1,#來源資料類型1:csv,2:web crawl                            
                'flag_fieldmapping':2, #欄位對應1:第一欄新增資料日期，2:完全對應，3:自訂對應(在DataImport.py中GetFieldMappingArray新增)
                'first_row_header':2,#'日期'
                'path_rawcsv':rawfile_path,
                'path_stdcsv':stdfile_path,
                'Array_TargetFieldDataType': ("D", "S", "S", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N"),
                'Array_SourceFieldDataType': ("D", "S", "S", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N", "N"),
                'Array_TargetFieldDataName': ("日期","股票代號()","股票名稱","開盤價","最高價","最低價","收盤價","漲跌","漲幅","振幅","成交量","成交筆數","成交金額","均張","成交量變動","均張變動","股本","總市值","市值比重","本益比","股價淨值比","本益比4","週轉率","成交值比重","漲跌停","成交量_股"),
                'sp_name':'usp_md_cm_ta_dailyquotes_adj_Add'},  
    'md_cm_ta_dailystatistics' : {'dcname' : 'md_cm_ta_dailystatistics',
                'url' : '',
                'get_param' : {},
                'flag_sourcetype':1,#來源資料類型1:csv,2:web crawl                            
                'flag_fieldmapping':2, #欄位對應1:第一欄新增資料日期，2:完全對應，3:自訂對應(在DataImport.py中GetFieldMappingArray新增)
                'first_row_header':2,#'日期'
                'path_rawcsv':rawfile_path,
                'path_stdcsv':stdfile_path,
                'Array_TargetFieldDataType': ("D","S","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N"),
                'Array_SourceFieldDataType': ("D","S","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N"),
                'Array_TargetFieldDataName': ("日期","股票代號","股票名稱","K(9)","D(9)","RSI(5)","RSI(10)","DIF","MACD","DIF-MACD","W%R(5)","W%R(10)","+DI(14)","-DI(14)","ADX(14)","週K(9)","週D(9)","週RSI(5)","週RSI(10)","週DIF","週MACD","週DIF-週MACD","週+DI(14)","週-DI(14)","週ADX(14)","月K(9)","月D(9)","月RSI(5)","月RSI(10)","月DIF","月MACD","月DIF-月MACD","月+DI(14)","月-DI(14)","月ADX(14)","季K(9)","季D(9)","季RSI(5)","季RSI(10)","季DIF","季MACD","季DIF-季MACD","季+DI(14)","季-DI(14)","季ADX(14)","Alpha(250D)","Beta係數(21D)","Beta係數(65D)","Beta係數(250D)","年化波動度(21D)","年化波動度(250D)","乖離率(20日)","乖離率(60日)","乖離率(250日)","相對強弱比(日)","相對強弱比(週)","近一月歷史波動率(%)","近二月歷史波動率(%)","近三月歷史波動率(%)","近六月歷史波動率(%)","近九月歷史波動率(%)","近一年歷史波動率(%)","EWMA波動率(%)"),
                'sp_name':'usp_md_cm_ta_dailyquotes_adj_Add'}, 
    'bd_cm_companyprofile' : {'dcname' : 'bd_cm_companyprofile',
                'url' : '',
                'get_param' : {},
                'flag_sourcetype':1,#來源資料類型1:csv,2:web crawl                            
                'flag_fieldmapping':2, #欄位對應1:第一欄新增資料日期，2:完全對應，3:自訂對應(在DataImport.py中GetFieldMappingArray新增)
                'first_row_header':2,#'日期'
                'path_rawcsv':rawfile_path,
                'path_stdcsv':stdfile_path,
                'Array_TargetFieldDataType': ("N","S","S","S","S","S","S","S","S","S","S","S","S","S","N","D","D","D","D","D","N","S","S","S","S","N","S","S","S","S","N","S","S","S","S","S","S","S","S","N","N","N","N","N","N","N","S","N","S","N","N","N"),
                'Array_SourceFieldDataType': ("N","S","S","S","S","S","S","S","S","S","S","S","S","S","N","D","D","D","D","D","N","S","S","S","S","N","S","S","S","S","N","S","S","S","S","S","S","S","S","N","N","N","N","N","N","N","S","N","S","N","N","N"),
                'Array_TargetFieldDataName': ("年度","股票代號","股票名稱","中文簡稱","英文簡稱","公司名稱","英文名稱","地址","電話","傳真機號碼","註冊地國名","訴訟代理人","訴訟代理人電話","訴訟代理人地址","實收資本額(百萬)","成立日期","上市日期","上櫃日期","興櫃日期","公發日期","存續年度","董事長","總經理","發言人","發言人職稱","上市上櫃","網址","電子信箱","股票過戶機構","股務代理電話","產業代號","產業名稱","英文產業名稱","產業指數代號","產業指數名稱","指數彙編分類代號","指數彙編分類","經營項目","國際證券編碼","統一編號","交易所公告股本(千)","交易所普通股股本(千)","交易所特別股股本(千)","交易所普通股股數(千)","交易所特別股股數(千)","普通股每股面額(元)","每股幣別","公告採用匯率","簽證會計師事務所","前年度內銷比重(%)","前年度外銷比重(%)","員工人數(人)"),
                'sp_name':'usp_bd_cm_companyprofile_Add'} ,
    'md_cm_fi_monthsales' : {'dcname' : 'md_cm_fi_monthsales',
                'url' : '',
                'get_param' : {},
                'flag_sourcetype':1,#來源資料類型1:csv,2:web crawl                            
                'flag_fieldmapping':2, #欄位對應1:第一欄新增資料日期，2:完全對應，3:自訂對應(在DataImport.py中GetFieldMappingArray新增)
                'first_row_header':2,#'日期'
                'path_rawcsv':rawfile_path,
                'path_stdcsv':stdfile_path,
                'Array_TargetFieldDataType':  ("N","S","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","D"),
                'Array_SourceFieldDataType': ("N","S","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","D"),
                'Array_TargetFieldDataName': ("年月","股票代號","股票名稱","單月合併營收(千)","去年單月合併營收(千)","單月合併營收年成長(%)","單月合併營收月變動(%)","累計合併營收(千)","去年累計合併營收(千)","累計合併營收成長(%)","近三月合併營收(千)","近三月合併營收年成長(%)","近三月合併營收月變動(%)","近12月累計合併營收(千)","近12月營收合併成長(%)","預估年營收(千)","累計營收達成率(%)","單月營收(千)","去年單月營收(千)","單月營收年成長(%)","單月營收月變動(%)","累計營收(千)","去年累計營收(千)","累計營收成長(%)","近三月營收(千)","近三月營收年成長(%)","近三月營收月變動(%)","近12月累計營收(千)","近12月營收成長(%)","淨值(千)","資金貸放餘額(千)","資金貸放佔淨值比(%)","背書保證單月金額(千)","背書保證累計餘額(千)","背書保証累計餘額佔淨值比(%)","重要子公司本月營業收入淨額(千)","重要子公司本年累計營收淨額(千)","公告日"),
                'sp_name':'usp_md_cm_fi_monthsales_Add'},
    'md_cm_fi_bs_quarterly' : {'dcname' : 'md_cm_fi_bs_quarterly',
                'url' : '',
                'get_param' : {},
                'flag_sourcetype':1,#來源資料類型1:csv,2:web crawl                            
                'flag_fieldmapping':2, #欄位對應1:第一欄新增資料日期，2:完全對應，3:自訂對應(在DataImport.py中GetFieldMappingArray新增)
                'first_row_header':2,#'日期'
                'path_rawcsv':rawfile_path,
                'path_stdcsv':stdfile_path,
                'Array_TargetFieldDataType': ("S","S","S","N","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","D","D","D"),
                'Array_SourceFieldDataType': ("S","S","S","N","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","D","D","D"),
                'Array_TargetFieldDataName': ("年季","股票代號","股票名稱","市場別","財報類別","流動資產(千)","　現金及約當現金(千)","　透過損益按公允價值衡量之金融資產–流動(千)","　透過其他綜合損益按公允價值衡量之金融資產–流動(千)","　備供出售金融資產–流動(千)","　持有至到期日金融資產–流動(千)","　按攤銷後成本衡量之金融資產–流動(千)","　避險之金融資產–流動(千)","　合約資產–流動(千)","　以成本衡量之金融資產–流動(千)","　無活絡市場之債務工具投資–流動(千)","　短期投資合計(千)","　避險之衍生金融資產–流動(千)","　應收票據淨額(千)","　應收票據–關係人淨額(千)","　應收帳款淨額(千)","　應收帳款–關係人淨額(千)","　應收帳款與票據合計(千)","　應收建造合約款(千)","　應收建造合約款–關係人淨額(千)","　應收營業租賃款淨額(千)","　應收營業租賃款淨額–關係人淨額(千)","　應收融資租賃款淨額(千)","　應收融資租賃款淨額–關係人淨額(千)","　其他應收款(千)","　其他應收款–關係人(千)","　本期所得稅資產(千)","　生物資產(千)","　存貨(千)","　在建工程(千)","　預付款項(千)","　取得合約之增額成本–流動(千)","　待退回產品權利–流動(千)","　履行合約成本–流動(千)","　其他流動資產(千)","非流動資產(千)","　透過損益按公允價值衡量之金融資產–非流動(千)","　透過其他綜合損益按公允價值衡量之金融資產–非流動(千)","　備供出售金融資產–非流動(千)","　持有至到期日金融資產–非流動(千)","　避險之衍生金融資產–非流動(千)","　按攤銷後成本衡量之金融資產–非流動(千)","　避險之金融資產–非流動(千)","　合約資產–非流動(千)","　以成本衡量之金融資產–非流動(千)","　無活絡市場之債務工具投資–非流動(千)","　採用權益法之投資(千)","　長期投資合計(千)","　不動產、廠房及設備(千)","　　土地(千)","　　土地改良物(千)","　　房屋及建築(千)","　　機器設備(千)","　　運輸設備(千)","　　租賃資產淨額(千)","　　其他不動產、廠房及設備(千)","　礦產資源(千)","　使用權資產(千)","　投資性不動產(千)","　無形資產(千)","　　商標權(千)","　　專利權(千)","　　商譽(千)","　　其他無形資產(千)","　遞延所得稅資產(千)","　存出保證金(千)","　遞延費用(千)","　長期應收票據及款項(千)","　長期應收票據及款項–關係人(千)","　取得合約之增額成本–非流動(千)","　預付投資款(千)","　待退回產品權利–非流動(千)","　履行合約成本–非流動(千)","　其他非流動資產(千)","資產總計(千)","流動負債(千)","　短期借款(千)","　應付短期票券(千)","　透過損益按公允價值衡量之金融負債–流動(千)","　避險之衍生金融負債–流動(千)","　避險之金融負債–流動(千)","　合約負債–流動(千)","　按攤銷後成本衡量之金融負債–流動(千)","　以成本衡量之金融負債–流動(千)","　應付票據(千)","　應付票據–關係人(千)","　應付帳款(千)","　應付帳款–關係人(千)","　應付建造合約款(千)","　應付建造合約款–關係人(千)","　其他應付款(千)","　其他應付款項–關係人(千)","　應付租賃款–流動(千)","　淨確定福利負債–流動(千）","　本期所得稅負債(千)","　負債準備–流動(千)","　與待出售非流動資產直接相關之負債(千)","　租賃負債–流動(千)","　預收款項(千)","　一年或一營業週期內到期長期負債(千)","　　一年或一營業週期內到期或執行賣回權公司債(千)","　　一年或一營業週期內到期長期借款(千)","　　一年或一營業週期內到期長期應付票據及款項－非關係人(千)","　　一年或一營業週期內到期長期應付票據及款項－關係人(千)","　退款負債–流動(千)","　財務保證負債–流動(千)","　其他流動負債(千)","非流動負債(千)","　透過損益按公允價值衡量之金融負債–非流動(千)","　避險之衍生金融負債–非流動(千)","　避險之金融負債–非流動(千)","　按攤銷後成本衡量之金融負債–非流動(千)","　以成本衡量之金融負債–非流動(千)","　合約負債–非流動(千)","　應付公司債(千)","　長期借款(千)","　長期應付票據及款項(千)","　長期應付票據及款項–關係人(千)","　長期遞延收入(千)","　特別股負債–非流動(千)","　長期負債合計(千)","　負債準備–非流動(千)","　本期所得稅負債–非流動(千)","　遞延所得稅負債(千)","　租賃負債–非流動(千)","　淨確定福利負債–非流動(千)","　存入保證金(千)","　退款負債–非流動(千)","　財務保證負債–非流動(千)","　其他非流動負債(千)","負債總計(千)","股本(千)","　普通股股本(千)","　特別股股本(千)","　債券換股權利證書(千)","　預收股本(千)","　待分配股票股利(千)","　特別股轉換普通股權利證書(千)","權益–具證券性質虛擬通貨(千)","資本公積(千)","　資本公積–發行溢價(千)","　資本公積–庫藏股票交易(千)","　資本公積–買回具證券性質虛擬通貨(千)","　資本公積–取得或處分子公司股權價格與帳面價值差額(千)","　資本公積–處分資產增益(千)","　資本公積–受贈資產(千)","　資本公積–採用權益法認列關聯企業及合資股權淨值之變動數(千)","　資本公積–合併溢額(千)","　資本公積–員工認股權(千)","　資本公積–認股權(千)","　資本公積–其他(千)","保留盈餘(千)","　法定盈餘公積(千)","　特別盈餘公積(千)","　未分配盈餘(千)","其他權益(千)","　國外營運機構財務報表換算之兌換差額(千)","　透過其他綜合損益按公允價值衡量之金融資產未實現評價損益(千)","　備供出售金融資產未實現損益(千)","　現金流量避險中屬有效避險部分之避險工具損益(千)","　國外營運機構淨投資避險中屬有效避險部分之避險工具損益(千)","　按公允價值衡量之金融負債信用風險變動影響數(千)","　確定福利計畫再衡量數(千)","　避險工具之損益(千)","　不動產重估增值(千)","　與待出售非流動資產直接相關之權益(千)","　其他權益項目(千)","庫藏股票(千)","共同控制下前手權益(千)","合併前非屬共同控制股權(千)","母公司業主權益(千)","非控制權益(千)","權益總計(千)","每股淨值(元)","原始每股淨值(元)","公告每股淨值(元)","負債及權益總計(千)","預收股款之約當發行股數(股)","母公司暨子公司所持有之母公司庫藏股(股)","建立日期","更新日期","公告日期"),
                'sp_name':'usp_md_cm_fi_bs_quarterly_Add'},
    'md_cm_fi_is_quarterly' : {'dcname' : 'md_cm_fi_is_quarterly',
                'url' : '',
                'get_param' : {},
                'flag_sourcetype':1,#來源資料類型1:csv,2:web crawl                            
                'flag_fieldmapping':2, #欄位對應1:第一欄新增資料日期，2:完全對應，3:自訂對應(在DataImport.py中GetFieldMappingArray新增)
                'first_row_header':2,#'日期'
                'path_rawcsv':rawfile_path,
                'path_stdcsv':stdfile_path,
                'Array_TargetFieldDataType': ("N","S","S","N","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","D","D","D"),
                'Array_SourceFieldDataType': ("N","S","S","N","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","D","D","D"),
                'Array_TargetFieldDataName': ("年季","股票代號","股票名稱","市場別","財報類別","銷貨收入淨額(千)","　銷貨收入(千)","　銷貨退回(千)","　銷貨折讓(千)","營業收入淨額(千)","營業成本(千)","營業毛利(千)","　聯屬公司間未實現利益(千)","　聯屬公司間已實現利益(千)","營業毛利淨額(千)","營業費用(千)","　推銷費用(千)","　管理費用(千)","　研發費用(千)","　預期信用減損損益(千)","　其他營業費用(千)","其他收益及費損(千)","　其他收益(千)","　其他費損(千)","營業利益(千)","營業外收入及支出(千)","其他收入(千)","　利息收入(千)","　租金收入(千)","　權利金收入(千)","　股利收入(千)","　廉價購買利益(千)","　手續費收入(千)","　違約金收入(千)","　歸墊收入(千)","　壞帳轉回利益(千)","　沖銷逾期應付款利益(千)","　其他收入(千)","其他利益及損失(千)","　手續費支出(千)","　停工損失(千)","　虧損性合約損失(千)","　保證合約損失(千)","　賠償損失(千)","　什項支出(千)","　其他利益及損失(千)","　處分不動產、廠房及設備淨損益(千)","　處分投資性不動產淨損益(千)","　處分無形資產淨損益(千)","　處分投資淨損益(千)","　售後租回移轉權利淨損益(千)","　使用權資產轉租淨損益(千)","　租賃修改淨損益(千)","　外幣兌換淨損益(千)","　透過損益按公允價值衡量之金融資產及負債淨損益(千)","　按攤銷後成本衡量之金融負債淨損益(千)","　當期原始認列生物資產之淨損益(千)","　生物資產當期公允價值減出售成本變動之淨損益(千)","　公允價值調整利淨損益–投資性不動產(千)","　不動產、廠房及設備重估價利淨損益(千)","　無形資產重估價淨損益(千)","　減損迴轉淨損益(千)","財務成本(千)","　避險工具之利益(千)","　歸因於所規避風險之被避險項目之利益–公允價值避險(千)","　現金流量避險無效而認列於損益之利益(千)","　現金流量避險有效而自權益轉列之利益(千)","　國外營運機構淨投資避險無效而認列於損益之利益(千)","　利息費用(千)","　負債性特別股股息(千)","　避險工具之損失(千)","　歸因於所規避風險之被避險項目之損失–公允價值避險(千)","　現金流量避險無效而認列於損益之損失(千)","　現金流量避險有效自權益轉列之損失(千)","　國外營運機構淨投資避險無效而認列於損益之損失(千)","　其他財務成本(千)","預期信用減損損益(千)","　預期信用減損利益(千)","　預期信用減損損失(千)","採用權益法之關聯企業及合資損益之份額(千)","　採用權益法認列之關聯企業及合資利益之份額(千)","　採用權益法認列之關聯企業及合資損失之份額(千)","除列按攤銷後成本衡量金融資產淨損益(千)","　除列按攤銷後成本衡量金融資產利益(千)","　除列按攤銷後成本衡量金融資產損失(千)","金融資產重分類淨損益(千)","　金融資產重分類利益(千)","　金融資產重分類損失(千)","營業外收入(千)","營業外支出(千)","稅前純益(千)","所得稅(千)","繼續營業單位損益(千)","停業部門損益(千)","合併前非屬共同控制股權損益(千)","稅後純益(千)","其他綜合損益(千)","　不重分類至損益之項目(千)","　　確定福利計畫之再衡量數(千)","　　不動產重估增值(千)","　　指定按公允價值衡量之金融負債信用風險變動影響數(千)","　　與待出售非流動資產直接相關之權益–不重分類至損益(千)","　　透過其他綜合損益按公允價值衡量之權益工具投資未實現評價損益(千)","　　避險工具之損益–不重分類至損益(千)","　　採權益法認列之關聯企業及合資其他綜合損益之份額–不重分類至損益(千)","　　不重分類至損益之其他項目(千)","　　與不重分類之項目相關之所得稅(千)","　後續可能重分類至損益之項目(千)","　　合併前非屬共同控制股權綜合損益淨額(千)","　　國外營運機構財務報表換算之兌換差額(千)","　　備供出售金融資產未實現評價損益(千)","　　現金流量避險中屬有效避險部分之避險工具損益(千)","　　國外營運機構淨投資避險中屬有效避險部分之避險工具損益(千)","　　與待出售非流動資產直接相關之權益–可能重分類至損益(千)","　　透過其他綜合損益按公允價值衡量之債務工具投資未實現評價損益(千)","　　避險工具之損益–可能重分類至損益(千)","　　採權益法認列關聯企業及合資其他綜合損益之份額–可能重分類至損益(千)","　　可能重分類至損益之其他項目(千)","　　與可能重分類至損益之項目相關之所得稅(千)","綜合損益(千)","稅後純益歸屬(千)","　母公司業主–稅後純益(千)","　非控制權益–稅後純益(千)","　共同控制下前手權益–稅後純益(千)","綜合損益歸屬(千)","　母公司業主–綜合損益(千)","　非控制權益–綜合損益(千)","　共同控制下前手權益–綜合損益(千)","EBITDA(千)","公告基本每股盈餘(元)","公告稀釋每股盈餘(元)","原始每股稅前盈餘(元)","原始每股稅後盈餘(元)","原始每股綜合盈餘(元)","每股稅前盈餘(元)","每股稅後盈餘(元)","每股綜合盈餘(元)","更新日期","公告日期","建立日期"),
                'sp_name':'usp_md_cm_fi_is_quarterly_Add'},
    'md_cm_fi_cf_quarterly' : {'dcname' : 'md_cm_fi_cf_quarterly',
                'url' : '',
                'get_param' : {},
                'flag_sourcetype':1,#來源資料類型1:csv,2:web crawl                            
                'flag_fieldmapping':2, #欄位對應1:第一欄新增資料日期，2:完全對應，3:自訂對應(在DataImport.py中GetFieldMappingArray新增)
                'first_row_header':2,#'日期'
                'path_rawcsv':rawfile_path,
                'path_stdcsv':stdfile_path,
                'Array_TargetFieldDataType': ("N","N","S","S","N","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","D","D","D"),
                'Array_SourceFieldDataType': ("N","N","S","S","N","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","D","D","D"),
                'Array_TargetFieldDataName': ("年度","年季","股票代號","股票名稱","市場別","財報類別","稅前純益(千)","調整項目(千)","營業活動現金流量(千)","不影響現金流量之收益費損項目(千)","　折舊費用(千)","　攤銷費用(千)","　預期信用減損損益數(千)","　透過損益按公允價值衡量金融資產及負債之淨損益(千)","　備供出售金融資產之淨損益(千)","　以成本衡量之金融資產及負債之淨損益(千)","　無活絡市場之債務工具投資損益之淨損益(千)","　持有至到期日金融資產之淨損益(千)","　利息費用(千)","　除列按攤銷後成本衡量金融資產淨損益(千)","　金融資產重分類淨損益(千)","　利息收入(千)","　股利收入(千)","　各項保險負債淨變動(千)","　具金融商品性質之保險契約準備淨變動(千)","　外匯價格變動準備淨變動(千)","　保證責任準備淨變動(千)","　其他各項負債準備淨變動(千)","　股份基礎給付酬勞成本(千)","　應付公司債匯率影響數(千)","　處分承受擔保品提存損益(千)","　資產證券化損益(千)","　採用權益法認列之關聯企業及合資損益之份額(千)","　處分及報廢不動產、廠房及設備損益(千)","　不動產、廠房及設備轉列費用數(千)","　處分投資性不動產損益(千)","　處分無形資產損益(千)","　處分其他資產損益(千)","　處分待出售非流動資產損益(千)","　處分投資損益(千)","　處分採用權益法之投資損益(千)","　營業外金融商品按公允價值衡量之損益(千)","　未實現認購售權證發行損益(千)","　金融資產減損損失(千)","　金融資產減損迴轉利益(千)","　非金融資產減損損失(千)","　非金融資產減損迴轉利益(千)","　未實現銷貨損益(千)","　已實現銷貨損益(千)","　未實現外幣兌換損益(千)","　買回應付公司債損益(千)","　出售及攤銷不良債權之損失(千)","　處分承受擔保品損益(千)","　逾期未領董監酬勞轉列其他收入(千)","　投資性不動產公允價值調整損益(千)","　其他收益費損項目(千)","與營業活動相關資產之淨變動(千)","　持有供交易之金融資產增減(千)","　強制透過損益按公允價值衡量之金融資產增減(千)","　避險之衍生金融資產增減(千)","　避險之金融資產增減(千)","　合約資產增減(千)","　應收票據增減(千)","　應收票據–關係人增減(千)","　應收帳款增減(千)","　應收帳款–關係人增減(千)","　應收建造合約款增減(千)","　其他應收款增減(千)","　其他應收款–關係人增減(千)","　存貨增減(千)","　生物資產增減(千)","　預付費用增減(千)","　預付款項增減(千)","　其他流動資產增減(千)","　其他金融資產增減(千)","　遞延借項增減(千)","　取得合約之增額成本增減(千)","　履行合約成本增減(千)","　存放央行及拆借金融同業增減(千)","　透過損益按公允價值衡量之金融資產增減(千)","　備供出售金融資產增減(千)","　附賣回票券及債券投資增減(千)","　應收款項增減(千)","　貼現及放款增減(千)","　再保險合約資產增減(千)","　持有至到期日金融資產增減(千)","　應收保費增減(千)","　預付費用及其他預付款增減(千)","　存出保證金增減(千)","　存出再保責任準備金增減(千)","　暫付及待結轉帳項增減(千)","　附賣回債券投資增減(千)","　附賣回票券投資增減(千)","　應收證券融資款增減(千)","　轉融通保證金增減(千)","　應收轉融通擔保價款增減(千)","　應收證券借貸款項增減(千)","　客戶保證金專戶增減(千)","　應收期貨交易保證金增減(千)","　借券擔保價款增減(千)","　借券保證金–存出增減(千)","　淨確定福利資產增減(千)","　違約證券增減(千)","　以成本衡量之金融資產增減(千)","　放款增減(千)","　無活絡市場之債務工具投資增減(千)","　催收款項增減(千)","　其他營業活動資產增減(千)","與營業活動相關負債之淨變動(千)","　持有供交易之金融負債增減(千)","　避險之衍生金融負債增減(千)","　避險之金融負債增減(千)","　合約負債增減(千)","　應付票據增減(千)","　應付票據–關係人增減(千)","　應付帳款增減(千)","　應付帳款–關係人增減(千)","　應付建造合約款增減(千)","　其他應付款增減(千)","　其他應付款–關係人增減(千)","　負債準備增減(千)","　預收款項增減(千)","　其他金融負債增減(千)","　其他流動負債增減(千)","　淨確定福利負債增減(千)","　遞延貸項增減(千)","　以成本衡量之金融負債增減(千)","　央行及銀行同業存款增減(千)","　透過損益按公允價值衡量之金融負債增減(千)","　附買回票券及債券負債增減(千)","　應付商業本票增減(千)","　應付款項增減(千)","　存款及匯款增加減(千)","　其他金融負債增加減(千)","　員工福利負債準備增減(千)","　負債準備增加減(千)","　應付保險賠款與給付增減(千)","　應付再保賠款與給付增減(千)","　應付佣金增減(千)","　應付再保往來款項增減(千)","　預收收益增減(千)","　遞延手續費收入增減(千)","　存入保證金增減(千)","　存入再保責任準備金增減(千)","　暫收及待結轉款項增減(千)","　附買回債券負債增減(千)","　附買回票券負債增減(千)","　融券保證金增減(千)","　應付融券擔保價款增減(千)","　轉融通借入款增減(千)","　借券保證金–存入增減(千)","　期貨交易人權益增減(千)","　代收款項增減(千)","　長期遞延收入增減(千)","　其他營業活動負債增減(千)","營運產生之現金流動(千)","　收取之利息–營業活動(千)","　收取之股利–營業活動(千)","　支付之利息–營業活動(千)","　支付之股利(千)","　退還及支付之所得稅–營業活動(千)","　其他營運產生之現金流動(千)","營業活動之收現類別(千)","　自銷售商品及提供勞務之收現(千)","　自權利金、各項收費、佣金及其他收入之收現(千)","　自持有供經紀或交易目的之合約之收現(千)","　自保費與理賠、年金及其他保單利益之收現(千)","　再保險之收現(千)","　自租金及後續出售該等資產之收現(千)","　其他營業活動之收現類別(千)","營業活動之付現類別(千)","　對商品及勞務供應商之付現(千)","　對持有供經紀或交易目的之合約之付現(千)","　對員工及代員工之付現(千)","　對保費與理賠、年金及其他保單利益之付現(千)","　再保險之付現(千)","　其他營業活動之付現類別(千)","投資活動現金流量(千)","　取得透過其他綜合損益按公允價值衡量之金融資產(千)","　處分透過其他綜合損益按公允價值衡量之金融資產(千)","　透過其他綜合損益按公允價值衡量之金融資產減資退回股款(千)","　取得按攤銷後成本衡量之金融資產(千)","　處分按攤銷後成本衡量之金融資產(千)","　按攤銷後成本衡量之金融資產到期還本(千)","　取得透過損益按公允價值衡量之金融資產(千)","　處分透過損益按公允價值衡量之金融資產(千)","　取得備供出售金融資產(千)","　處分備供出售金融資產(千)","　備供出售金融資產減資退回股款(千)","　取得無活絡市場之債務工具投資(千)","　處分無活絡市場之債務工具投資(千)","　無活絡市場之債務工具投資到期還本(千)","　取得持有至到期日金融資產(千)","　處分持有至到期日金融資產(千)","　持有至到期日金融資產到期還本(千)","　取得以成本衡量之金融資產(千)","　處分以成本衡量之金融資產(千)","　以成本衡量之金融資產減資退回股款(千)","　取得避險之衍生金融資產–投資活動(千)","　取得避險之金融資產–投資活動(千)","　處分避險之衍生金融資產–投資活動(千)","　處分避險之金融資產–投資活動(千)","　除列避險之衍生金融負債–投資活動(千)","　除列避險之金融負債–投資活動(千)","　取得採用權益法之投資(千)","　處分採用權益法之投資(千)","　預付投資款增加(千)","　預付投資款減少(千)","　對子公司之收購(千)","　處分子公司(千)","　採用權益法之被投資公司減資退回股款(千)","　取得待出售非流動資產(千)","　處分待出售非流動資產(千)","　取得不動產、廠房及設備(千)","　處分不動產、廠房及設備(千)","　預收款項增加–處分資產(千)","　預收款項減少–處分資產(千)","　信託業賠償準備金增加(千)","　信託業賠償準備金減少(千)","　營業保證金增加(千)","　營業保證金減少(千)","　交割結算基金增加(千)","　交割結算基金減少(千)","　存出保證金增加(千)","　存出保證金減少(千)","　存出再保責任準備金增加(千)","　存出再保責任準備金減少(千)","　其他應收款增加(千)","　其他應收款減少(千)","　其他應收款–關係人增加(千)","　其他應收款–關係人減少(千)","　取得無形資產(千)","　處分無形資產(千)","　處分承受擔保品(千)","　取得承受擔保品(千)","　概括承受他公司之淨現金收取數(千)","　因合併產生之現金流入(千)","　概括承受他公司之賠付款(千)","　取得使用權資產(千)","　放款增加(千)","　放款減少(千)","　取得投資性不動產(千)","　處分投資性不動產(千)","　附賣回票券及債券投資增加(千)","　附賣回票券及債券投資減少(千)","　應收款項增加(千)","　應收款項減少(千)","　長期應收租賃款增加(千)","　長期應收租賃款減少(千)","　出售不良債權回饋金(千)","　已收現之出售不良債權(千)","　買回已出售之不良債權(千)","　其他金融資產增加(千)","　其他金融資產減少(千)","　其他非流動資產增加(千)","　其他非流動資產減少(千)","　預付房地款增加(千)","　預付房地款減少(千)","　預付設備款增加(千)","　預付設備款減少(千)","　其他預付款項增加(千)","　其他預付款項減少(千)","　收取之利息–投資活動(千)","　收取之股利–投資活動(千)","　退還及支付之所得稅–投資活動(千)","　其他投資活動現金流量(千)","籌資活動現金流量(千)","　短期借款增加(千)","　短期借款減少(千)","　央行及同業融資增加(千)","　央行及同業融資減少(千)","　應付短期票券增加(千)","　應付短期票券減少(千)","　應付商業本票增加(千)","　應付商業本票減少(千)","　取得避險之衍生金融資產–籌資活動(千)","　取得避險之金融資產–籌資活動(千)","　處分避險之衍生金融資產–籌資活動(千)","　處分避險之金融資產–籌資活動(千)","　除列避險之衍生金融負債–籌資活動(千)","　除列避險之金融負債–籌資活動(千)","　發行公司債(千)","　償還公司債(千)","　發行金融債券(千)","　償還金融債券(千)","　舉借長期借款(千)","　償還長期借款(千)","　其他借款增加(千)","　其他借款減少(千)","　附買回票券及債券負債增加(千)","　附買回票券及債券負債減少(千)","　指定為透過損益按公允價值衡量之金融負債增加(千)","　指定為透過損益按公允價值衡量之金融負債減少(千)","　按攤銷後成本衡量之金融負債增加(千)","　按攤銷後成本衡量之金融負債減少(千)","　以成本衡量之金融負債增加(千)","　以成本衡量之金融負債減少(千)","　發行特別股負債(千)","　償還特別股負債(千)","　存入保證金增加(千)","　存入保證金減少(千)","　金融資產證券化款項(千)","　存入再保責任準備金增加(千)","　存入再保責任準備金減少(千)","　應付款項增加(千)","　應付款項減少(千)","　其他應付款–關係人增加(千)","　其他應付款–關係人減少(千)","　應付租賃款增加(千)","　應付租賃款減少(千)","　租賃本金償還(千)","　其他金融負債增加(千)","　其他金融負債減少(千)","　其他非流動負債增加(千)","　其他非流動負債減少(千)","　發放現金股利(千)","　現金增資(千)","　現金減資(千)","　發行具證券性質虛擬通貨(千)","　員工執行認股權(千)","　庫藏股票買回成本(千)","　庫藏股票處分(千)","　買回具證券性質之虛擬通貨(千)","　員工購買庫藏股(千)","　子公司發行特別股(千)","　合併發行新股追溯調整(千)","　取得子公司股權(千)","　處分子公司股權(千)","　支付之利息–籌資活動(千)","　退還及支付之所得稅–籌資活動(千)","　非控制權益變動(千)","　其他籌資活動現金流量(千)","匯率變動對現金及約當現金之影響(千)","本期現金及約當現金增減數(千)","期初現金及約當現金餘額(千)","期末現金及約當現金餘額(千)","自由現金流量(千)","更新日期","公告日期","建立日期"),
                'sp_name':'usp_md_cm_fi_cf_quarterly_Add'},
    'md_cm_fd_foreigninsttraing' : {'dcname' : 'md_cm_fd_foreigninsttraing',
                'url' : '',
                'get_param' : {},
                'flag_sourcetype':1,#來源資料類型1:csv,2:web crawl                            
                'flag_fieldmapping':2, #欄位對應1:第一欄新增資料日期，2:完全對應，3:自訂對應(在DataImport.py中GetFieldMappingArray新增)
                'first_row_header':2,#'日期'
                'path_rawcsv':rawfile_path,
                'path_stdcsv':stdfile_path,
                'Array_TargetFieldDataType': ("D","S","S","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","S"),
                'Array_SourceFieldDataType': ("D","S","S","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","S"),
                'Array_TargetFieldDataName': ("日期","股票代號","股票名稱","外資買張","外資賣張","外資買賣超","外資持股異動","外資持股張數","外資及陸資(不含外資自營商)買張","外資及陸資(不含外資自營商)賣張","外資及陸資(不含外資自營商)買賣超","外資自營商買張","外資自營商賣張","外資自營商買賣超","外資買金額(千)","外資賣金額(千)","外資買賣超金額(千)","外資買均價","外資賣均價","外資持股比率(%)","外資持股市值(百萬)","外資持股成本","外資尚可投資張數","外資尚可投資比率(%)","外資投資上限比率(%)","陸資投資上限比率(%)","與前日異動原因"),
                'sp_name':'usp_md_cm_fd_foreigninsttraing_Add'},
    'md_cm_fd_brokertrading' : {'dcname' : 'md_cm_fd_brokertrading',
                'url' : '',
                'get_param' : {},
                'flag_sourcetype':1,#來源資料類型1:csv,2:web crawl                            
                'flag_fieldmapping':2, #欄位對應1:第一欄新增資料日期，2:完全對應，3:自訂對應(在DataImport.py中GetFieldMappingArray新增)
                'first_row_header':2,#'日期'
                'path_rawcsv':rawfile_path,
                'path_stdcsv':stdfile_path,
                'Array_TargetFieldDataType': ("D","S","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N"),
                'Array_SourceFieldDataType': ("D","S","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N"),
                'Array_TargetFieldDataName': ("日期","股票代號","股票名稱","自營商買張","自營商賣張","自營商買賣超","自營商買張(自行買賣)","自營商賣張(自行買賣)","自營商買賣超(自行買賣)","自營商買張(避險)","自營商賣張(避險)","自營商買賣超(避險)","自營商庫存","自營商買金額(千)","自營商賣金額(千)","自營商買賣超金額(千)","自營商買均價","自營商賣均價","自營商持股比率(%)","自營商持股市值(百萬)","自營商持股成本"),
                'sp_name':'usp_md_cm_fd_brokertrading_Add'},
    'md_cm_fd_investmenttrusttrading' : {'dcname' : 'md_cm_fd_investmenttrusttrading',
                'url' : '',
                'get_param' : {},
                'flag_sourcetype':1,#來源資料類型1:csv,2:web crawl                            
                'flag_fieldmapping':2, #欄位對應1:第一欄新增資料日期，2:完全對應，3:自訂對應(在DataImport.py中GetFieldMappingArray新增)
                'first_row_header':2,#'日期'webcrawl
                
                'path_rawcsv':rawfile_path,
                'path_stdcsv':stdfile_path,
                'Array_TargetFieldDataType': ("D","S","S","N","N","N","N","N","N","N","N","N","N","N","N"),
                'Array_SourceFieldDataType': ("D","S","S","N","N","N","N","N","N","N","N","N","N","N","N"),
                'Array_TargetFieldDataName': ("日期","股票代號","股票名稱","投信買張","投信賣張","投信買賣超","投信庫存","投信買金額(千)","投信賣金額(千)","投信買賣超金額(千)","投信買均價","投信賣均價","投信持股比率(%)","投信持股市值(百萬)","投信持股成本"),
                'sp_name':'usp_md_cm_fd_investmenttrusttrading_Add'},
    'md_cm_fd_stockholderstructure' : {'dcname' : 'md_cm_fd_stockholderstructure',
                'url' : '',
                'get_param' : {},
                'flag_sourcetype':1,#來源資料類型1:csv,2:web crawl                            
                'flag_fieldmapping':2, #欄位對應1:第一欄新增資料日期，2:完全對應，3:自訂對應(在DataImport.py中GetFieldMappingArray新增)
                'first_row_header':2,#'日期'
                'path_rawcsv':rawfile_path,
                'path_stdcsv':stdfile_path,
                'Array_TargetFieldDataType': ("D","S","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N"),
                'Array_SourceFieldDataType': ("D","S","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N"),
                'Array_TargetFieldDataName': ("日期","股票代號","股票名稱","近1週1000張以上集保比率變動(%)","1張以下(人)","5張以下(人)","10張以下(人)","15張以下(人)","20張以下(人)","30張以下(人)","40張以下(人)","50張以下(人)","100張以下(人)","200張以下(人)","400張以下(人)","600張以下(人)","800張以下(人)","1張以上(人)","5張以上(人)","10張以上(人)","15張以上(人)","20張以上(人)","30張以上(人)","40張以上(人)","50張以上(人)","100張以上(人)","200張以上(人)","400張以上(人)","600張以上(人)","800張以上(人)","1000張以上(人)","1張以下(張)","5張以下(張)","10張以下(張)","15張以下(張)","20張以下(張)","30張以下(張)","40張以下(張)","50張以下(張)","100張以下(張)","200張以下(張)","400張以下(張)","600張以下(張)","800張以下(張)","1張以上(張)","5張以上(張)","10張以上(張)","15張以上(張)","20張以上(張)","30張以上(張)","40張以上(張)","50張以上(張)","100張以上(張)","200張以上(張)","400張以上(張)","600張以上(張)","800張以上(張)","1000張以上(張)","1張以下佔集保比率(%)","5張以下佔集保比率(%)","10張以下佔集保比率(%)","15張以下佔集保比率(%)","20張以下佔集保比率(%)","30張以下佔集保比率(%)","40張以下佔集保比率(%)","50張以下佔集保比率(%)","100張以下佔集保比率(%)","200張以下佔集保比率(%)","400張以下佔集保比率(%)","600張以下佔集保比率(%)","800張以下佔集保比率(%)","1張以上佔集保比率(%)","5張以上佔集保比率(%)","10張以上佔集保比率(%)","15張以上佔集保比率(%)","20張以上佔集保比率(%)","30張以上佔集保比率(%)","40張以上佔集保比率(%)","50張以上佔集保比率(%)","100張以上佔集保比率(%)","200張以上佔集保比率(%)","400張以上佔集保比率(%)","600張以上佔集保比率(%)","800張以上佔集保比率(%)","1000張以上佔集保比率(%)"),
                'sp_name':'usp_md_cm_fd_stockholderstructure_Add'},
    'md_cm_fd_insiderholdingstructure' : {'dcname' : 'md_cm_fd_insiderholdingstructure',
                'url' : '',
                'get_param' : {},
                'flag_sourcetype':1,#來源資料類型1:csv,2:web crawl                            
                'flag_fieldmapping':2, #欄位對應1:第一欄新增資料日期，2:完全對應，3:自訂對應(在DataImport.py中GetFieldMappingArray新增)
                'first_row_header':2,#'日期'
                'path_rawcsv':rawfile_path,
                'path_stdcsv':stdfile_path,
                'Array_TargetFieldDataType': ("S","S","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N"),
                'Array_SourceFieldDataType': ("S","S","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N"),
                'Array_TargetFieldDataName': ("年月","股票代號","股票名稱","董事持股張數","董事持股張數增減","董事持股比例(%)","董事持股比例增減","董事關係人持股張數","董事關係人持股張數增減","董事關係人持股比例(%)","董事關係人持股比例增減","董事及其關係人持股張數","董事及其關係人持股張數增減","董事及其關係人持股比例(%)","董事及其關係人持股比例增減","監察人持股張數","監察人持股張數增減","監察人持股比例(%)","監察人持股比例增減","監察人關係人持股張數","監察人關係人持股張數增減","監察人關係人持股比例(%)","監察人關係人持股比例增減","監察人及其關係人持股張數","監察人及其關係人持股張數增減","監察人及其關係人持股比例(%)","監察人及其關係人持股比例增減","董監持股張數","董監持股張數增減","董監持股比例(%)","董監持股比例增減","董監及其關係人持股張數","董監及其關係人持股張數增減","董監及其關係人持股比例(%)","董監及其關係人持股比例增減","經理人持股張數","經理人持股張數增減","經理人持股比例(%)","經理人持股比例增減","經理人關係人持股張數","經理人關係人持股張數增減","經理人關係人持股比例(%)","經理人關係人持股比例增減","經理人及其關係人持股張數","經理人及其關係人持股張數增減","經理人及其關係人持股比例(%)","經理人及其關係人持股比例增減","大股東持股張數","大股東持股張數增減","大股東持股比例(%)","大股東持股比例增減","大股東關係人持股張數","大股東關係人持股張數增減","大股東關係人持股比例(%)","大股東關係人持股比例增減","大股東及其關係人持股張數","大股東及其關係人持股張數增減","大股東及其關係人持股比例(%)","大股東及其關係人持股比例增減","大股東經理人持股張數","大股東經理人持股張數增減","大股東經理人持股比例(%)","大股東經理人持股比例增減","大股東經理人及其關係人持股張數","大股東經理人及其關係人持股張數增減","大股東經理人及其關係人持股比例(%)","大股東經理人及其關係人持股比例增減","內部人持股張數","內部人持股張數增減","內部人持股比例(%)","內部人持股比例增減","內部人關係人持股張數","內部人關係人持股張數增減","內部人關係人持股比例(%)","內部人關係人持股比例增減","內部人及其關係人持股張數","內部人及其關係人持股張數增減","內部人及其關係人持股比例(%)","內部人及其關係人持股比例增減","全體持股張數","全體持股張數增減","全體持股比例(%)","全體持股比例增減","全體關係人持股張數","全體關係人持股張數增減","全體關係人持股比例(%)","全體關係人持股比例增減","全體及其關係人持股張數","全體及其關係人持股張數增減","全體及其關係人持股比例(%)","全體及其關係人持股比例增減","董事設質張數","董事設質張數增減","董事設質比例(%)","董事設質比例增減","董事關係人設質張數","董事關係人設質張數增減","董事關係人設質比例(%)","董事關係人設質比例增減","董事及其關係人設質張數","董事及其關係人設質張數增減","董事及其關係人設質比例(%)","董事及其關係人設質比例增減","監察人設質張數","監察人設質張數增減","監察人設質比例(%)","監察人設質比例增減","監察人關係人設質張數","監察人關係人設質張數增減","監察人關係人設質比例(%)","監察人關係人設質比例增減","監察人及其關係人設質張數","監察人及其關係人設質張數增減","監察人及其關係人設質比例(%)","監察人及其關係人設質比例增減","董監設質張數","董監設質張數增減","董監設質比例(%)","董監設質比例增減","董監及其關係人設質張數","董監及其關係人設質張數增減","董監及其關係人設質比例(%)","董監及其關係人設質比例增減","經理人設質張數","經理人設質張數增減","經理人設質比例(%)","經理人設質比例增減","經理人關係人設質張數","經理人關係人設質張數增減","經理人關係人設質比例(%)","經理人關係人設質比例增減","經理人及其關係人設質張數","經理人及其關係人設質張數增減","經理人及其關係人設質比例(%)","經理人及其關係人設質比例增減","大股東設質張數","大股東設質張數增減","大股東設質比例(%)","大股東設質比例增減","大股東關係人設質張數","大股東關係人設質張數增減","大股東關係人設質比例(%)","大股東關係人設質比例增減","大股東及其關係人設質張數","大股東及其關係人設質張數增減","大股東及其關係人設質比例(%)","大股東及其關係人設質比例增減","大股東經理人設質張數","大股東經理人設質張數增減","大股東經理人設質比例(%)","大股東經理人設質比例增減","大股東經理人及其關係人設質張數","大股東經理人及其關係人設質張數增減","大股東經理人及其關係人設質比例(%)","大股東經理人及其關係人設質比例增減","內部人設質張數","內部人設質張數增減","內部人設質比例(%)","內部人設質比例增減","內部人關係人設質張數","內部人關係人設質張數增減","內部人關係人設質比例(%)","內部人關係人設質比例增減","內部人及其關係人設質張數","內部人及其關係人設質張數增減","內部人及其關係人設質比例(%)","內部人及其關係人設質比例增減","全體設質張數","全體設質張數增減","全體設質比例(%)","全體設質比例增減","全體關係人設質張數","全體關係人設質張數增減","全體關係人設質比例(%)","全體關係人設質比例增減","全體及其關係人設質張數","全體及其關係人設質張數增減","全體及其關係人設質比例(%)","全體及其關係人設質比例增減","董事私募張數","董事私募張數增減","董事私募比例(%)","董事私募比例增減","董事關係人私募張數","董事關係人私募張數增減","董事關係人私募比例(%)","董事關係人私募比例增減","董事及其關係人私募張數","董事及其關係人私募張數增減","董事及其關係人私募比例(%)","董事及其關係人私募比例增減","監察人私募張數","監察人私募張數增減","監察人私募比例(%)","監察人私募比例增減","監察人關係人私募張數","監察人關係人私募張數增減","監察人關係人私募比例(%)","監察人關係人私募比例增減","監察人及其關係人私募張數","監察人及其關係人私募張數增減","監察人及其關係人私募比例(%)","監察人及其關係人私募比例增減","董監私募張數","董監私募張數增減","董監私募比例(%)","董監私募比例增減","董監及其關係人私募張數","董監及其關係人私募張數增減","董監及其關係人私募比例(%)","董監及其關係人私募比例增減","經理人私募張數","經理人私募張數增減","經理人私募比例(%)","經理人私募比例增減","經理人關係人私募張數","經理人關係人私募張數增減","經理人關係人私募比例(%)","經理人關係人私募比例增減","經理人及其關係人私募張數","經理人及其關係人私募張數增減","經理人及其關係人私募比例(%)","經理人及其關係人私募比例增減","大股東私募張數","大股東私募張數增減","大股東私募比例(%)","大股東私募比例增減","大股東關係人私募張數","大股東關係人私募張數增減","大股東關係人私募比例(%)","大股東關係人私募比例增減","大股東及其關係人私募張數","大股東及其關係人私募張數增減","大股東及其關係人私募比例(%)","大股東及其關係人私募比例增減","大股東經理人私募張數","大股東經理人私募張數增減","大股東經理人私募比例(%)","大股東經理人私募比例增減","大股東經理人及其關係人私募張數","大股東經理人及其關係人私募張數增減","大股東經理人及其關係人私募比例(%)","大股東經理人及其關係人私募比例增減","內部人私募張數","內部人私募張數增減","內部人私募比例(%)","內部人私募比例增減","內部人關係人私募張數","內部人關係人私募張數增減","內部人關係人私募比例(%)","內部人關係人私募比例增減","內部人及其關係人私募張數","內部人及其關係人私募張數增減","內部人及其關係人私募比例(%)","內部人及其關係人私募比例增減","全體私募張數","全體私募張數增減","全體私募比例(%)","全體私募比例增減","全體關係人私募張數","全體關係人私募張數增減","全體關係人私募比例(%)","全體關係人私募比例增減","全體及其關係人私募張數","全體及其關係人私募張數增減","全體及其關係人私募比例(%)","全體及其關係人私募比例增減","獨立董事人數","常董人數","一般董事人數","董事總人數","獨立監察人數","常監人數","一般監察人數","監察總人數"),
                'sp_name':'usp_md_cm_fd_insiderholdingstructure_Add'},
    'md_cm_fd_insiderdholdingetail' : {'dcname' : 'md_cm_fd_insiderdholdingetail',
                'url' : '',
                'get_param' : {},
                'flag_sourcetype':1,#來源資料類型1:csv,2:web crawl                            
                'flag_fieldmapping':2, #欄位對應1:第一欄新增資料日期，2:完全對應，3:自訂對應(在DataImport.py中GetFieldMappingArray新增)
                'first_row_header':2,#'日期'
                'path_rawcsv':rawfile_path,
                'path_stdcsv':stdfile_path,
                'Array_TargetFieldDataType': ("S","S","S","S","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N"),
                'Array_SourceFieldDataType': ("S","S","S","S","S","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N"),
                'Array_TargetFieldDataName': ("年月","股票代號","股票名稱","身份別","姓名","選任時持有張數","持股張數","持股比例(%)","設質張數","設質比例(%)","私募張數","私募比例(%)","以他人名義持有張數","以他人名義持有私募張數","以他人名義設質張數","以他人名義設質比例(%)","集中市場買進股數","其它原因取得","集中市場賣出股數","其它原因轉讓","流水編號"),
                'sp_name':'usp_md_cm_fd_insiderdholdingetail_Add'},
    'md_cm_ot_dividendpolicy_20211215' : {'dcname' : 'md_cm_ot_dividendpolicy_20211215', #20211215 cmoney將原本"權利分派基準日"拆分為兩欄 "除權分派基準日"與"除息分派基準日"
                'url' : '',
                'get_param' : {},
                'flag_sourcetype':1,#來源資料類型1:csv,2:web crawl                            
                'flag_fieldmapping':2, #欄位對應1:第一欄新增資料日期，2:完全對應，3:自訂對應(在DataImport.py中GetFieldMappingArray新增)
                'first_row_header':2,#'日期'
                'path_rawcsv':rawfile_path,
                'path_stdcsv':stdfile_path,
                'Array_TargetFieldDataType': ("S","S","S","S","D","D","D","D","D","D","D","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","S","D","D","D","D","S","N","N","N"),
                'Array_SourceFieldDataType': ("S","S","S","S","D","D","D","D","D","D","D","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","S","D","D","D","D","S","N","N","N"),
                'Array_TargetFieldDataName': ("年季","股票代號","股票名稱","盈餘分派頻率","除權日","除權最後回補日","除息日","除息最後回補日","權利分派基準日","領股日期","領息日期","盈餘配股(元)","公積配股(元)","股票股利合計(元)","盈餘配息(元)","公積配息(元)","現金股利合計(元)","股利合計(元)","股票股利發放率(%)","現金股利發放率(%)","股利發放率(%)","除權開盤競價基準","除息開盤競價基準","除權參考價","除息參考價","除權前股價","除息前股價","除權前股本(百萬)","除權後股本(百萬)","除權前市值比重(%)","除息前市值比重(%)","現金股利殖利率(%)","股東股票股利總配股數(張)","股東現金紅利總金額(千)","員工酬勞配股(張)","員工配股金額(千)","員工紅利配股佔盈餘配股比例(%)","員工酬勞現金(千)","董監酬勞(千)","酬勞差異數(千)","董事會備註","董事會決議通過股利分派日","股東會日期","公告日期","現增除權日","現增類別","現增認購價","現增配股(股)","現增總額(百萬)"),
                'sp_name':'usp_md_cm_ot_dividendpolicy_20211215_Add'},
    'md_cm_ot_dividendpolicy' : {'dcname' : 'md_cm_ot_dividendpolicy',
                'url' : '',
                'get_param' : {},
                'flag_sourcetype':1,#來源資料類型1:csv,2:web crawl                            
                'flag_fieldmapping':2, #欄位對應1:第一欄新增資料日期，2:完全對應，3:自訂對應(在DataImport.py中GetFieldMappingArray新增)
                'first_row_header':2,#'日期'
                'path_rawcsv':rawfile_path,
                'path_stdcsv':stdfile_path,
                'Array_TargetFieldDataType': ("S","S","S","S","D","D","D","D","D","D","D","D","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","S","D","D","D","D","S","N","N","N"),
                'Array_SourceFieldDataType': ("S","S","S","S","D","D","D","D","D","D","D","D","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","N","S","D","D","D","D","S","N","N","N"),
                'Array_TargetFieldDataName': ("年季","股票代號","股票名稱","盈餘分派頻率","除權日","除權最後回補日","除息日","除息最後回補日","除權分派基準日","除息分派基準日","領股日期","領息日期","盈餘配股(元)","公積配股(元)","股票股利合計(元)","盈餘配息(元)","公積配息(元)","現金股利合計(元)","股利合計(元)","股票股利發放率(%)","現金股利發放率(%)","股利發放率(%)","除權開盤競價基準","除息開盤競價基準","除權參考價","除息參考價","除權前股價","除息前股價","除權前股本(百萬)","除權後股本(百萬)","除權前市值比重(%)","除息前市值比重(%)","現金股利殖利率(%)","股東股票股利總配股數(張)","股東現金紅利總金額(千)","員工酬勞配股(張)","員工配股金額(千)","員工紅利配股佔盈餘配股比例(%)","員工酬勞現金(千)","董監酬勞(千)","酬勞差異數(千)","董事會備註","董事會決議通過股利分派日","股東會日期","公告日期","現增除權日","現增類別","現增認購價","現增配股(股)","現增總額(百萬)"),
                'sp_name':'usp_md_cm_ot_dividendpolicy_Add'},
    'md_cm_ta_dailytrading' : {'dcname' : 'md_cm_ta_dailytrading',
            'url' : '',
            'get_param' : {},
            'flag_sourcetype':1,#來源資料類型1:csv,2:web crawl                            
            'flag_fieldmapping':2, #欄位對應1:第一欄新增資料日期，2:完全對應，3:自訂對應(在DataImport.py中GetFieldMappingArray新增)
            'first_row_header':2,#'日期'
            'path_rawcsv':rawfile_path,
            'path_stdcsv':stdfile_path,
            'Array_TargetFieldDataType': ("D","S","S","N","N","N","N","N","N"),
            'Array_SourceFieldDataType': ("D","S","S","N","N","N","N","N","N"),
            'Array_TargetFieldDataName': ("日期","股票代號","股票名稱","當沖成交量","當沖買進成交金額","當沖賣出成交金額","當沖成交量比重","當沖買進成交值比重","當沖賣出成交值比重"),
            'sp_name':'usp_md_cm_ta_dailytrading_Add'}
     }  
    return dc_setting[dcname] 
class MARKETRAWDB_CM_IMPORTER():
    
    def __init__(self, dcname, querydate, rawfile_path, stdfile_path, dbconfig: dict) -> None:
        self.dcname = dcname
        self.querydate = querydate
        self.datadate = get_datadate(self.dcname, self.querydate)
        self.dc_info = dc_settings(self.dcname, rawfile_path, stdfile_path)
        self.db_config = dbconfig
    def data_import(self) -> None:
        time_start = perf_counter()

        is_error=0
        try:
            #crawl data
            # procname='crawlwebdata'
            # crawlwebdata(dc_info,datadate)
            #data conversion
            procname='rawcsv_to_stdcsv'
            rawcsv_to_stdcsv(self.dc_info, self.datadate)
            #import db
            procname='importdb_stdcsv'
            importdb_stdcsv(self.dc_info, self.db_config)
        except Exception as err: 
            log.error('Error occurred --> MARKETRAWDB_CM_IMPORTER.data_import("%s"): %s' % (self.dcname,err))
            is_error = 1
            insert_log_sys(self.db_config, self.querydate, self.datadate, self.dcname, procname, 1, procname + ' error occrred!',str(err),float(perf_counter()-time_start))
        finally:
            log.debug("exec time: MARKETRAWDB_CM_IMPORTER.data_import(%s) : %s sec" % (self.dcname, str(perf_counter()-time_start)))
            if is_error != 1:
                procname='MARKETRAWDB_CM_IMPORTER.data_import'
                insert_log_sys(self.db_config, self.querydate, self.datadate, self.dcname, procname,0,'','Data Update Completed!',float(perf_counter()-time_start))




    
            


